export const experience = [
    {
        company: "ООО \"КАРНАСТ\"",
        city: "Чебоксары",
        position: "Fullstack-разработчик",
        date: "Март 2023 - по настоящее время",
        description: `— Был главным разработчиком на проекте;
— Разрабатывал клиентскую часть приложения;
— Разрабатывал чат по интересам пользователей. Чат был реализован через websocket(socket.io);
— Занимался созданием статистики по пройденным анкетам среди учреждений;
— Разрабатывал админ-панель;
— Разрабатывал систему приглашений пользователей по иерархии.
— Занимался подключением оплаты через Yookassa;
— Разрабатывал серверную часть;
— Проектировал схему базы данных;
— Занимался настройкой веб-сервера (Nginx);
— Занимался отправкой сообщений на электронную почту;
— Занимался сохранением файлов на облачный сервис Yandex Cloud через библиотеку Easy-Yandex-S3;
— Стек клиенсткой части: React, NextJS, Redux-Toolkit, TailwindCSS, TypeScript и другие библиотеки для UI;
— Стек для серверной части: Node.js, Express.js, TypeScript`
    },
    {
        company: "ООО \"ЭКСПА СОФТВАР\"",
        city: "Чебоксары",
        position: "Frontend-разработчик",
        date: "Март 2021 - Июль 2023",
        description: `— Разрабатывал лендинги, учетные системы, MES-системы;
— В параллели работал на 2-3 проектах, большую часть из которых начинал с нуля;
— Вырос до позиции middle-уровня;
— Был назначен тимлидом команды;
— Управлял командой из 9 человек: проводил с каждым беседы, чтобы узнать есть ли какие-то проблемы при выполнении поставленых задач, помогал решать если были проблемы;
— Проводил технические собеседования для найма сотрудников;
— Проводил ревью/рефакторинг кода;
— Написал UI-библиотеку для использования на проектах;
— Принимал участие в разработке мобильных приложений на React-Native;
— Занимался созданием документации по проектам;
— Принимал решения выбора архитектуры для проекта`
    },
    {
        company: "АВТОНОМНОЕ УЧРЕЖДЕНИЕ \"ЦЕНТРАЛЬНЫЙ СТАДИОН ИМ.А.Г.НИКОЛАЕВА\"",
        city: "Новочебоксарск",
        position: "Веб-разработчик",
        date: "Октябрь 2020 - Март 2021",
        description: `— Занимался разработкой новостного портала;
— Создавал дизайн проекта;
— Обсуждал с клиентом функционал проекта;
— Разрабатывал клиентскую и серверную часть + админ-панель;
— Подключал WYSIWYG - редактор для создание новостей;
— Занимался настройкой веб-сервера (Nginx);
— Занимался отправкой сообщений на электронную почту;
— Проектировал схему базы данных;
— Стек: Vanilla Javascript, Jquery, PHP, Lavaravel;`
    },
]