export const experience = [
    {
        company: "ООО \"КАРНАСТ\"",
        city: "Чебоксары",
        position: "Fullstack-разработчик",
        date: "Март 2023 - по настоящее время",
        description: "Я был главным разработчиком на проекте, в мои обязанности входило разработка клиентской и серверной части. На клиентской части использовался стек: React, NextJS, Tailwindcss, Redux-Toolkit и другие библиотеки для UI. В проекте также есть чат для общения между участниками который работает через websocket(использовал библиотеку socket.io). На северной стороне был следующий стек: Node.js, Express.js, Typescript. Также занимался настройкой веб-сервера(Nginx)"
    },
    {
        company: "ООО \"КАРНАСТ\"",
        city: "Чебоксары",
        position: "Frontend-разработчик",
        date: "Март 2021 - Июль 2023",
        description: "Занимался разработкой веб-приложений, сайтов, большую часть времени разрабатывал учетные системы. Стек для клиента был NextJs, React, Redux-toolkit, Tailwindcss. Небольшое время занимался разработкой мобильных приложений на React- Native. За время работы я вырос до middle - уровня, а позже меня назначили тимлидом.В мои обязанности входило проводить ревью кода, проводить технических собеседования, расстановкой задач, создание документации по проектам, выбор архитектуры проекта."
    },
    {
        company: "АВТОНОМНОЕ УЧРЕЖДЕНИЕ \"ЦЕНТРАЛЬНЫЙ СТАДИОН ИМ.А.Г.НИКОЛАЕВА\"",
        city: "Чебоксары",
        position: "Frontend-разработчик",
        date: "Октябрь 2020 - Март 2021",
        description: "Занимался разработкой новостного портала - клиентской и серверной части. В проекте была возможность создание личного кабинета, просмотра новостей, писать комментарии к новостям. Также в проекте была админ- часть сайта, в нем была возможность создавать новости(текст, фото, таблицы), для этого использовался WYSIWYG - редактор, модерация комментариев, добавление пользователей в админ - панель. Также с помощью этого редактора можно было создавать новые страниц как вложенные так и нет. Стек проекта был следующим: PHP, Laravel, Vanilla JS, Jquery."
    },
]