export const projects = [
    {
        img: "/karnast.png",
        name: "Карнаст",
        description: "Сейчас это является мои основным проектом. Цель проекта это раннее выявление одаренности и профессиональных предпочтений обучающихся.Опрос был разработам профессором Чувашской Республики Волковым Олегом Гавриловичем он и является частью нашей команды.Проект был проведен в рамках тестирования по всем школам Чебоксар и в одной гимназии Казани в мае 2023 года и с 1 сентября 2023 года запущен в городе Дебальцево и по всей Чувашской Республике. Приложение предоставляет возмоность учителям/ завучам / директорам смотреть статистику по классам и определять в каких классах больше людей по тем или иным направлениям и опроса. Также учащиеся могут после прохождения опроса посмотреть какие колледжи / вузы / курсы в России подходят им исходя из пройденного опроса. На проекте я занимаюсь всей разработкой фронт и бэк, по фронту не много помогает друг который тоже является нашим участником."
    },
    {
        img: "/getseek.png",
        name: "GetSeek",
        description: "Getseek – это приложение – бот, в котором вы можете оставить заявку на любой товар или услугу. Вы будете получать предложения от поставщиков и исполнителей прямо в телеграмме. Для этого вам требуется всего лишь оставить заявку и получать предложения не тратя время на поиск. Если вы продаете товар или выполняете услуги, вы можете стать поставщиком/ исполнителем.Getseek сразу будет вам отправлять уведомление, как только сделают запрос на ваш товар или услугу."
    },
    {
        img: "/kalkkal.png",
        name: "KalKkal",
        description: " Проект создан чтобы расчитывать нужную норму калорий для человека. На сайте есть личный кабинет в котором можно добавлять свои приемы пищи в котором можно отслеживать сколько калорий употребили в день/неделю, также есть график который показывать текущую и прошлую неделю активности по поеданию. Проект делал для себя чтобы удобно было вести учет сколько пищи я съедаю:)"
    },
    {
        img: "/generepass.png",
        name: "GenerePass",
        description: "Этот проект делал в самом начале когда обучался React'у, помимо генерации пароля можно сохранить пароли(они хранятся в IndexedDB) и их можно скачать"
    },
    {
        img: "/gym_center.png",
        name: "GYM-center",
        description: "Макет был взят из телеграм-канала \"True Figma\", просто верстка"
    }
];